Repository: cseg-michigan/chez-betty
Catalog: chezbetty/locale/*/LC_MESSAGES/betty.po
Languages: ar, de, es, fr

source: user-not-enabled
ar: العضو غير فعال
de: nutzer-nicht-aktiviert
es: usuario-no-activo
fr: utilizateur-pas-activé

source: mcard-error
ar: مشكلة-إمكارد
de: mcard-fehler
es: error-mcard
fr: erreur-mcarte

source: Deposit amount must be greater than $0.00. Card NOT charged.
ar: الكمية الموضوعة يجب أن لا تقل عن $0.00. الكرت لم يتقاضى الكمية
de: Einzahlung muss höher als $0.00 sein. Karte NICHT belastet.
es: Monto del depósito debe ser mayor a $0.00. Tarjeta NO cargada.
fr: Le dépôt somme doit être supérieur à $0.00. Votre card n'est pas chargée.

source: Edit Deposit
ar: تغير الكمية الموضوعه
es: Editar Depósito

source: New Deposit Amount
ar: أضع كمية جديدة
es: Nuevo Monto a Depositar

source: Deposit To Your Account
ar: أضع كمية إلي حسابك
es: Depositar a Tu Cuenta

source: Deposit To %(pool_name)s Pool
ar: أضع كمية إلى حساب %(pool_name)s
es: Depositar a %(pool_name)s

source: Delete Deposit
ar: لغي الكمية الموضوعة
es: Borrar Depósito

source: Item Request
ar: طلب غرض
de: Neuer Artikel Anfrage
es: Solicitud de Producto
fr: Demande de l'article

source: Request a New Item at Chez Betty
ar: أطلب غرض جديد قي تشيز بتي
de: Ein neuer Artikel bei Chez Betty anfragen
es: Solicita un Nuevo Producto en Chez Betty
fr: Demandez un nouvel article

source: Home
ar: الرئيسية
es: Inicio

source: New Item Request
ar: إبدء طلب غرض جديد
de: Neuer Artikel Anfrage
es: Solicitud de un Nuevo Producto
fr: Demande d'un nouvel article

source: Enter an item you would like to see Betty sell. Please include where you purchased the item from before so we have a chance at finding it. We normally shop at Costco, Meijer, and Kroger, so if those stores do not carry it, it is unlikely that Betty will either.
ar: ادخل غرض تريد ان تري بتي يبيعه. الرجاء إشمل مكان ماإشتريت هذا الغرض من قبللكي نستطيع وجوده. عادتاً نشتري اغراضنا من كوسكو، ماير،او كروجر لذالك اذي غرضك ليس في هذه المحلات غالباً لن توجد عندنا.
es: Escribe un producto que te gustaría ver a Betty vender. Por favor incluye dónde conseguiste el producto para que tengamos la oportunidad de encontrarlo. Usualmente hacemos compras en Costco, Meijer y Kroger, asi que si estas tiendas no tienen el producto, es probable que Betty tampoco lo tenga.

source: Also, depending on your motivation, you could be the supplier of a new item. For instance, if you are grocery shopping you can pick up a few extra of what you want, add it the Betty system, and see if it sells well. The process is pretty simple (particularly for small numbers of items) and we can reimburse you by just writing a check. Get in touch with us if you are interested.
ar: أيضاً حسب نيتك، يمكنك أن تكون المورد لغرض جديد.مثلاً إذا انت تتسوق يمكنك ان تختار بضع من الزائد من الذي تريده, ضفه الي جهاز بيانات بتي، ثم تري اذا هاذا الغرض يبيع جيداً. العملية سهلة، خصوصاً لأعداد صغيرة من الأغراض، وسوف نعوضك بشيك. تواصل بنا اذا انت راغب
es: También dependiendo de tu motivación, tú podrías ser el proveedor de un nuevo producto. Por ejemplo, si estás haciendo compras puedes coger más del producto que quieras, añadirlo al sistema de Betty y ver si se vende bien. El proceso es simple (particularmente para productos de cantidad pequeña) y nosotros podemos reembolsarte escribiendo un cheque. Contáctanos si estás interesado/a.

source: Submit Request
ar: إبعت الطلب
de: Anfrage absenden
es: Enviar Solicitud
fr: Soumis Demande

source: Deposit
ar: أضع كمية
es: Depositar

source: Cash
ar: نقداَ
es: Efectivo

source: Your Deposit Limit: %(limit)s
ar: حد كمية الوضع لك: %(limit)s
es: Tu Límite del Depósito: %(limit)s

source: Bitcoin
ar: بتكوين

source: Credit Card
ar: كرت كردت
es: Tarjeta de Crédito

source: Betty now accepts credit cards!
ar: بتي الأن يستقبل كروت الكريدت!
es: Betty ahora acepta tarjetas de crédito!

source: To deposit using a credit card, please visit chezbetty.eecs.umich.edu/user in your browser.
ar: لكي تضع كمية بكرت الكريدت، الرجاء زيارة chezbetty.eecs.umichedu/user علي متصفحك.
es: Para depositar con tarjeta de crédito, por favor visita chezbetty.eecs.umich.edu/user en tu navegador web.

source: Purchase
ar: أشتري
de: Kaufen
es: Comprar
fr: Achat

source: Order Summary
ar: ملخص الطلب
es: Resúmen de la Orden

source: Item
ar: غرض
de: Artikel
es: Producto
fr: Article

source: Quantity
ar: كمية
de: Menge
es: Cantidad
fr: Quantité

source: Item Price
ar: سعر الغرض
de: Stückpreis
es: Precio del Producto
fr: Prix

source: Total Price
ar: السعر الشامل
de: Gesamtpreis
es: Precio Total
fr: Prix Total

source: Order Empty
ar: الطلب فارغ
de: Warenkorb leer
es: Orden Vacía
fr: Commande vide

source: Scan an item to begin
ar: إفحص الغرض بالمكنة لكي تبدأ
de: Scannen Sie einen Artikel ab, um anzufangen
es: Escanea un producto para empezar
fr: Commencez par scanner un article

source: Subtotal
ar: السعر الجزئي
de: Zwischensumme
fr: Sous total

source: Good Standing Discount
ar: خصم وضع جيد
de: Hoches Kontoguthaben Rabatt
es: Descuento Para Clientes en Buen Estado
fr: Réduction pour patrons en règle

source: Total
ar: المبلغ الكامل
de: Gesamtpreis

source: Pay With Your User Account
ar: إدفع بساي الضو
es: Pagar Con Tu Cuenta de Usuario

source: Pay With %(pool_name)s Pool
ar: إدفع بحساب %(pool_name)s
es: Pagar Con el Grupo %(pool_name)s

source: Customer
ar: زبون
es: Cliente

source: Name
ar: الإسم
es: Nombre

source: Account Balance
ar: رصيد الحساب
de: Kontostand
es: Saldo de la Cuenta
fr: Solde de compte

source: %(pool_name)s Balance
ar: رصيد %(pool_name)s
de: %(pool_name)s Kontostand
es: Saldo de %(pool_name)s
fr: %(pool_name)s solde de compte

source: Links
ar: رابط
es: Enlaces

source: Account
ar: الحساب
es: Cuenta

source: Logout
ar: الخروج
de: Abmelden
es: Cerrar sesión
fr: Déconnexion

source: Admin
ar: المشرف

source: Hi %(name)s,
ar: مرحباً %(name)s
de: Hallo %(name)s,
es: Hola %(name)s,
fr: Salut %(name)s,

source: You currently owe Betty %(big_debt)s. That's a lot of money!
ar: أنت مديون إلي بتي %(big_debt)s. هذه كمية كبيرة!
de: Sie schulden Betty im Moment %(big_debt)s. Das ist ziemlich viel Geld!
es: Actualmente debes %(big_debt)s a Betty. Eso es mucho dinero!
fr: Vous devez Betty %(big_debt)s actuellement. C'est beaucoup d'argent !

source: We're glad you like Betty. We're happy to extend a small line of credit, but if people owe Betty lots of money, it's hard to keep things in stock. Please try to pay Betty back soon!
ar: نحن ممتنون أنك تحب بتي. نحن مستعدون أن نضيف إلي خط الكردت، ولاكن اذا الأشخاص مديونون كثيراً إلي بتي، سوف يكون الأمر صعب أن نملئ المحل. الرجاء حاولو أن تدفعو إلي بتي قريباً!
de: Es freut uns, dass Betty Ihnen gefällt. Wir geben gern eine kleine Kreditlinie aus aber, wenn die Leute Betty ganz viel Geld schulden, wird es schwer, Waren vorrätig zu halten. Bitte versuchen Sie, Betty gleich zurückzuzahlen
es: Nos alegra que te guste Betty. Estamos felices de poder ofrecer un monto pequeño de crédito pero si las personas debes mucho dinero a Betty, es difícil mantener los productos en stock. Por favor trata de pagar a Betty lo antes posible!
fr: Nous somes heureux que vous aimez Betty. Nous sommes content de vous offrir une petite marge de credit, mais si les gens doivent Betty beaucoup d'argent, c'est difficile de garder beaucoup en stock. Essayez de rembourser Betty bientôt, s'il vous plaît !

source: You currently owe Betty %(debt)s.
ar: أنت مديون إلي بتي %(debt)s.
de: Sie schulden Betty im Moment %(debt)s.
es: Actualmente debes %(debt)s a Betty.
fr: Vous devez Betty %(debt)s actuellement.

source: Please try to pay Betty back soon, thanks!
ar: الرجاء رد ديونك فريباً، شكراً
de: Versuchen Sie bitte gleich, Betty zurückzuzahlen. Danke!
es: Por favor trata de pagar a Betty pronto, gracias!
fr: Essayez de rembourser Betty bientôt, s'il vous plaît !

source: Transaction History
ar: تاريخ التعامل
es: Historial de Transacciones

source: Purchase totaling %(amount)s
ar: مجموع الشراء %(amount)s
es: Compra total %(amount)s

source: touch to show
ar: إلمس لكي تري
es: toca para mostrar

source: touch to hide
ar: إلمس لكي تخبي
es: toca para esconder

source: Discounts
ar: تخفيضات
de: Rabatte
es: Descuentos
fr: Réductions

source: Deposit of %(amount)s
ar: وضع كمية %(amount)s
es: Depósito de %(amount)s

source: Credit Card Deposit of %(amount)s
ar: كمية كرت كردت الموضوعة %(amount)s
es: Depósito con Tarjeta de Crédito de %(amount)s

source: Card ending in %(last4)s
ar: اخر ارقام الكرت $(last4)s
de: Die Karte, deren letze 4 ziffern sind %(last4)s
es: Tarjeta termina con %(last4)s
fr: Carte fini à %(last4)s

source: Adjustment of %(amount)s by %(admin_name)s
ar: تغير بكمية %(amount)s من $(admmin_name)s
de: Richtigstellung von %(amount)s von %(admin_name)s
es: Ajuste de %(amount)s por %(admin_name)s
fr: Adjustement de %(amount)s par %(admin_name)s

source: BTC Deposit of %(amount_in_usd)s (%(amount_in_btc)s)
ar: وضع كميو بي تي سي %(amount_in_usd)s (%(amount_in_btc)s)
es: Depósito de BTC de %(amount_in_usd)s (%(amount_in_btc)s)

source: No transactions.
ar: لا تعاملات
de: Keine Transaktionen.
es: No hay transacciones.
fr: Pas de transactions

source: Show All
ar: أري الكل
es: Mostrar Todo

source: About Chez Betty
ar: عن تشيز بتي
de: Über Chez Betty
es: Acerca de Chez Betty
fr: À propos de Chez Betty

source: Chez Betty is an honor-system based food cooperative for graduate students, faculty, and staff in Computer Science at the University of Michigan. The name "Chez Betty" is an homage to Chez Bob, a similar system at UCSD.
ar: تشيز بتي هو محل طعام تعاوني علي نظام الشرف لطلاب الدراسة العلية، المدرسين، والعملاء في علم الكمبيوتر في جامعة متشيجن. الإسم "تشسز بتي" هو إسم بشرف تشيز بوب، نظام شبيه في يو سي إس دي.
de: Chez Betty ist eine Lebensmittel Genossenschaft, die Ehresytem basierend ist, für Studenten im Aufbaustudium, die Falkutät, und Mitarbeiterin der Informatikabteilung an der Universität Michigan. Der Name "Chez Betty" erweist Chez Bob, ein ähnliches System an der UCSD, seine Ehrebietung.
es: Chez Betty es una cooperativa de alimentos basada en un sistema de honor para estudiantes de posgrado, facultad, y personal de Informática en la Universidad de Michigan. El nombre "Chez Betty" es un homenaje a Chez Bob, un sistema similar en UCSD.
fr: Chez Betty est une coopérative utilizant le système d'honneur pour les etudiants diplômés, la faculté, et le personnel au Informatique a l'Université de Michigan. Le nom "Chez Betty" est une homage à Chez Bob, une système similaire à UCSD.

source: FAQ
ar: التعليمات
es: Preguntas Frecuentes

source: Touch questions to show/hide.
ar: إلمس الإسئلة لكي تراهم/تخبئه.
es: Toca las preguntas para mostrar/esconder.

source: Who are the awesome people who run Chez Betty?
ar: من هم الأناس الرائعون الذين يديرون تشيز بتي؟
de: Wer sind die tolle Leute, die Chez Betty führen?
es: ¿Quiénes son las increíbles personas que dirigen Chez Betty?
fr: Qui sont les gens géniaux qui dirigent Chez Betty?

source: Chez Betty is run by CSEG, the CSE graduate student group.
ar: تشيز بتي مدار من سي إس أي دجي، مجموعة سي إس إي لطلاب الدراسات العليا.
es: Chez Betty es dirigido por CSEG, el grupo estudiantil de posgrado en CSE

source: Currently, Betty is primarily maintained by Brad Campbell, Pat Pannuto, and Zakir Durumeriç
ar: حالياً، بتي يعتني من براد كامبيل، بات بانوتو، و زاكر دورميرك
es: Actualmente, Betty es mantenido por Brad Campbell, Pat Pannuto y Zakir Durumeriç

source: How to Use Betty like a Pro
ar: كبف تستعمل بتي بمهارة
de: Wie Betty zu benutzen, wie ein Pro
es: Cómo Usar Betty Como un Pro
fr: Comment utilizer Betty comme un pro

source: Keep a positive balance.
ar: حافظ علي رصيد جيد.
de: Behalten Sie ein positives Kontoguthaben.
es: Mantén un saldo positivo.
fr: Gardez un solde positif.

source: Tracking down debtors sucks for us and for you. You don't want to end up on the Wall of Shame!
ar: إتباع المديونون غير ممتع لنا ولك. أنت لاتريد أن تكون علي حائطة العار!
es: Rastrear a deudores es horrible para nosotros y para ti. No quieres terminar en el Muro de la VergÜenza!

source: Take advantage of the Bank of Betty.
ar: إستفيد من بنك بتي.
de: Nehmen Sie die Bank von Betty wahr.
es: Toma ventaja del Banco de Betty.
fr: Profitez de la banque de Betty.

source: Our power users usually deposit $100 once a year or so. Most people deposit $20 to use until that runs out. Remembering cash every time you want to use Betty is no fun.
ar: مستخدميننا الدائمون عادتاً يضعون $100 مرة كل سنة لاتقريب. معذم المستعمليت يضعو $20 ويستعملوهه حتي تنتهي. تذكر التقود كل مرة تريد إستخدام بتي غير ممتع.
de: Unsere supere Nutzer zahlen typischerweise ungefähr $100 pro Jahr. Die meisten Leute zahlen $20 ein, zu benutzen, bis es ausgeht. Es macht kein Spaß, Bar zu erinnern, immer wenn Sie in Betty gehen wollen.
es: Nuestros mejores usuarios usualmente depositan $100 más o menos una vez al año. La mayoría de personas depositan $20 para usar hasta que se termine. Acordarse de tener efectivo cada vez que quieras usar Betty no es divertido.
fr: Les grands utilizateurs normalement déposent 100$ par année environ. La majorité dépose 20$ pour utilizer jusqu'à c'est fini. Ce n'est pas amusant de se souvenir de porter l'argent chaque fois qu'on utilize Betty.

source: Help restock.
ar: ساعد ملء المخزون.
de: Wieder aufzufüllen helfen.
es: Ayuda a Reabastecer
fr: Aidez a réapprovisionner.

source: Betty is run by volunteers who have finite time. If you grab a cold drink, put a warm one in to get cold (though, don't put it in front!). If you finish a box of food, grab a full box and replace it.
ar: بتي مدار من متطوعين عنجهم وقت محدود. إذ أخذت مشروب بارد، ضع مشروب ساخن بدلة لكي يبرد (لكن لا تضع المشروب في الأمام!) إذ أنت إنتهيت صنندوق طعام، بدلة بصندوق أخر.
de: Betty wird von Freiwilligen geführt, die begrenzte Zeit haben. Wenn Sie ein kaltes Getränk vom Kühlschrank kriegen, setzen Sie ein Wärmes wiederrein (aber nicht davor!). Wenn Sie ein Kästchen von Essen ausbenutzen, nehmenSie ein volles Kästchen davon und ersetzen Sie es.
es: Betty es manejado por voluntarios que tienen un tiempo limitado. Si coges una bebida fría, pon una caliente para que se enfríe (pero no lo pongas al frente!). Si terminas una caja de comida, coge una llena y reemplázalo.
fr: Betty est dirigée par des bénévoles qui ont de la temps limitée. Si vous prenez une boisson froide, remplace-la avec une boisson chaude (mais ne la mettez pas au devant !) Si vous finissez une boîte de nourriture, remplace-la avec une pleine.

source: How do I buy things from Chez Betty?
ar: كيف أشتري أشياء من بتي؟
de: Wie bekommt man Dinge von Chez Betty eigentlich?
es: ¿Cómo compro cosas de Chez Betty?
fr: Comment acheter de Chez Betty?

source: Log in to Chez Betty by swiping your MCard at the terminal.
ar: سجل الدخول إلي تشيز بتي بتمرير كرتك الإمكارد في الترمينال.
de: Ziehen Sie deine MCard an der Verladstation durch, um anzumelden.
es: Accede al sistema de Chez Betty pasando tu MCard en la terminal.
fr: Connectez à Chez Betty en passant votre MCarte au terminal.

source: Accounts are tied to your UMID.
ar: الأحسبة مربوطه برقم ال يو إم أي دي.
de: Konten sind mit Ihrer UMID Nummer verbunden.
es: Las cuentas están atadas a tu IDUM.
fr: Les comptes sont attachés a vos IDUM.

source: A new account is automatically created for first-time users on the the fly the first time you log in.
ar: حساب جديد يكون لك تلقائاً أول مرة تسجل الدخول.
de: Ein neues Konto wird für Sie automatisch erzeugt, zum ersten Mal Sie anmelden.
es: Una cuenta nueva es creada automaticante para usuarios que usan por primera vez cuando inician una sesión.
fr: Une nouvelle compte est creée automatiquement pour les utilizateurs la premèire fois qu'on ouvre une session.

source: Look at your Account Balance. If you're low, deposit some money.
ar: أنظر إلي حسابك. إذ كان قليل، ضع نقود.
de: Schau mal Ihr Kontoguthaben. Wenn es niedrig ist, zahlen sie etwas Geld ein.
es: Mira el Saldo de tu Cuenta. Si está bajo, deposita un poco de dinero.
fr: Vérifiez votre solde. Si elle est basse versez-y de l'argent.

source: Every user has an account with Chez Betty that keeps track of how much money they've put in.
ar: كل عضو عنده حساب مع تشيز بتي يحفظ كمية النقود التي وضعتها فيه.
de: Jeder/jede Nutzer/in hat ein Konto mit Chez Betty, das weiterverfolgt, wie viel Geld er/sie eingezahlt hat.
es: Cada usuario tiene una cuenta con Chez Betty que rastrea cuánto dinero el usuario ha puesto.
fr: Chaque utilizateur a une compte avec Chez Betty qui suit combien d'argent ils ont versés.

source: Betty doesn't make change, instead excess money stays in your account for your next transaction.
ar: بتي لا يعطي الباقي، إنه يضع النقود الزائدة في حسابك لتعاملك القادم.
de: Betty macht kein Kleingeld. Stattdessen bleibt überzähliges Geld inIhrem Konto zu Ihrer nächsten Transaktion.
es: Betty no tiene cambio, el dinero que sobra se queda en tu cuenta para tu próxima transacción.
fr: Betty ne fait pas la monnaie, plutôt l'argent extra reste dans votre compte pour la prochaine transaction.

source: You can run into the red, see below.
ar: يمكنك أن تكمل إلي الأحمر، إنظر أسفلاً.
de: Sie können in roten Zahlen gehen, schauen Sie nach unter.
es: Puedes llegar a la zona roja, mira abajo.
fr: Vous pouvez vous mettre dans le rouge, voyez à bas.

source: Grab what you'd like from Chez Betty and scan your items.
ar: خذ ما تريد من تشيز بتي و إفحص أغراضك بالمكينة.
de: Kriegen Sie das, was Sie von Betty wollen und scannen Sie ihre Artikel.
es: Coge lo que quieras de Chez Betty y escanea los productos.
fr: Prenez ceux que vous voulez de Chez Betty et scannez vos articles.

source: Touch "Submit Purchase" and you're done!
ar: إلمس "ٍSubmit Purchase" ولضد إنتهيت!
de: Drücken Sie "Einkauf absenden" und Sie sind fertig!
es: Toca "Submit Purchase" y está listo!
fr: Touchez "Achetez" et vous êtes fini!

source: Wait... Couldn't people steal from this really easily?
ar: إصتبر... ألا يمكن أن يسرقو الناس بسهولة؟
de: Wart kurz... Könnten Leute nicht ganz einfach davon stehlen?
es: Espera... ¿No es muy fácil para las personas robar?
fr: Attend..., on pourrait facilement voler, non?

source: Yes. (But please don't).
ar: نعم. (لكم الرجاء لا تسرقو).
de: Ja. (Aber machen Sie das bitte nicht).
es: Si. (Pero por favor no lo hagas).
fr: Oui. (Mais, s'il vous plaît, non).

source: The idea is to provide a convenient service to members of the UM CSE community. Betty makes a small profit off each sale, some of which will be used to cover the inevitable losses. If too many people take advantage of Betty's trusting nature, the service will have to shut down :(.
ar: الفكة هي أن نجعل مجال مناسب لأعضائ ال يو إم سي إس إي. بتي يربح قليلاً من كب بيعة، بعض منها يشمل الخسائر. إذ أشخاص كثيرة إستغلو ثقة بتي، الخدمة سوف تنتهي :(.
de: Die Idee dahinter ist, eine geeignete Dienst zu den Mitgliedern des UM CSE Gemeinschaft anzubieten. Betty bekommt einen kleinen Gewinn von jedem Verkauf, von dem einige benutz wird, um die unausweichliche Verluste zu decken. Wenn zu viele Leute Betty ausnutzen, muss Betty geschlossen werden :(.
es: La idea es proveer un servicio conveniente para miembros de la comunidad de CSE en UM. Betty hace una pequeña ganancia por cada venta, la cuál será usada para cubrir pérdidas inevitables. Si muchas personas se abusan de la confianza de Betty, el servicio tendrá que terminar :(.
fr: L'idée, c'est de donner une service commode aux membres de la communauté informatique de UM. Betty fait un profit petit de chaque vente, un portion qui sera utilizé pour couvrir les pertes inévitables. Si trop de gens abusent la confiance de Betty, la service devrait se fermer :(

source: Tell me more about my Chez Betty account?
ar: قلي المزيد عن حساب تشيز بتي؟
de: Erzählen Sie mir mehr von meinem Chez Betty Konto?
es: Cuéntame más sobre mi cuenta de Chez Betty
fr: Dites-moi plus au sujet de ma compte Chez Betty?

source: Chez Betty sells things nearly at-cost (usually about a 15% markup). Since no one likes change and Betty is a self-service operation, it's set up so that each user has an account with Betty. You can put in $20 (or however much) at a time and use that balance until it runs out.
ar: تشيز بتي يبيع الأشياء بسعر فريب الإنتاج (عادتاً قرب 15% من سعر الإنتاج). لأن لا أحد يريد الاقي و تشيز بتي هو نظام إخدم نفسك بنفسك، تم إعداده لكي كب عضو عنده حساب مع بتي. يمكنك تضع كمية $20، أو أي كمية، في أي وقت و تستعمله حتي يتنهي.
es: Chez Betty vende productos casi al mismo costo (usualmente en un sobreprecio de 15%). Como a nadie le gusta el cambio y Betty es una operación de autoservicio,está diseñado para que cada usuario tenga una cuenta con Betty. Puedes poner $20 (o cuanto quieras) a la vez y usar tu saldo hasta que se termine.

source: What if I don't have any money / Can my account balance go negative?
ar: إذ ليس عندي نقود / هل يمكن حسابي ينزل تحت الصفر؟
de: Was passiert wenn ich kein Geld dabei habe / Can mein Kontostand negativ werden?
es: ¿Qué pasa si no tengo dinero / Puede mi saldo ponerse negativo?
fr: Quoi faire si je n'ai pas d'argent/Peut la balance de ma compte devenir negatif?

source: Yes. Chez Betty allows you to spend beyond your immediate means under that assumption that you'll pay Betty back eventually. The idea is to let you grab stuff when you need it and keep track of what owe, instead of incentivizing folks to steal. There is a <a href="/shame">Wall of Shame</a> for persons who owe Betty more than $5.
ar: نعم. تشيز بتي يسمح لك أن تنفق أكثر من ما في حسابك علي الإفتراد أن الدين سوف يرد. الفكره أنكم لتأذو أين تحتاجو و تتذكرو الدين، بدلاً من أن تحفذ السرقة. هناك <a href="/shame">حائط العار</a> لكل شخص مديون لبتي أكثر من $5.
es: Si. Chez Betty permite que gastes más de lo que tienes asumiendo que eventualmente vas a pagarlo de vuelta a Betty. La idea que dejarte coger lo que necesites y mantenerte al tanto de lo que debes, en vez de incentivizar a las personas a robar. Hay un <a href="/shame">Muro de la VergÜenza</a> para personas que deben más de $5 a Betty.

source: How does Betty set prices?
ar: كيف بتي يسعر؟
de: Wie entscheidet Betty die Preise?
es: ¿Cómo fija los precios Betty?
fr: Comment Betty fixe-elle les prix?

source: Betty sells things just above wholesale, usually a 15% markup. If you're interested in the actual algorithm, check out Betty's source code at github.com/um-cseg/chez-betty.
ar: بتي يبيع أشياء فقط فوق الجملة، عادتاً 15% فوق سعر الإنتاج. إذ أنت راغب في الحل الحسابي، إنظر إلي مصدر بتي علي github.com/um-cseg/chez-betty.
es: Betty vende productos un poco más del precio al por mayor, usualmente un sobreprecio de 15%. Si te interesa saber acerca del algorítmo, chequea la fuente del código en github.com/um-cseg/chez-betty.

source: Current wholesale and Betty prices are always available on <a href="/items">the items page</a>.
ar: أسعار الجملة و بتي موجودون علي <a href="/items">صفحة الأغراض</a>.
de: Akutelle Grosshandel- und Bettypreise sind immer auf <a href="/items">der Produkte Seiten verfügbar</a>.
es: Los actuales precios al por mayor y los precios de Betty siempre están disponibles en <a href="/items">la página de productos</a>.
fr: Les prix de gros et de Betty sont toujours disponibles sur <a href="/items">la page d'articles</a>.

source: What does Betty do with her profits?
ar: مذا يفعل بتي بالأرباح؟
de: Was macht Betty mit ihren Gewinnen?
es: ¿Qué hace Betty con sus ganancias?
fr: Que fait Betty avec ses profits?
