Repository: cseg-michigan/chez-betty
Catalog: chezbetty/locale/*/LC_MESSAGES/betty.po
Languages: ar, de, es, fr

source: First, Betty has to pay her debts (e.g. any losses incurred from dishonest Chez Betty users). After that, Betty's profits roll into the CSEG general fund. They're used to fund improvements to Betty, buy miscellaneous needs (e.g. new ping pong paddles and balls), or to throw events (e.g. bar nights) for CSEG.
ar: أولاً،يجب علي بتي أن تدفع ديونها (مثلاً أي خسائر من اعضاء تشيز بتي المخادغين). ثم بعد، أرباح بتي ينتقلون إلي صندوق ال دجي إس إي يس العام هذه النقود تستخدم لتحسن بتي، لشراء أشياء متعديدة (مثلاً شراء مضارب وكمر بينج بونج)، أو لترتيب احداث (مثلاً ليال البار) لل سي إس إي جي.
es: Primeramente, Betty tiene que pagar sus deudas (ej. cualquier pérdida causada por usuarios deshonestos de Chez Betty). Después de eso, las ganancias van al fondo general de CSEG. Son usados para financiar mejoras a Betty, comprar necesidades misceláneas (ej. nuevas paletas ybolas de ping pong), u organizar events (ej. noches en bares) para CSEG.

source: If you have more questions / concerns, please feel free to talk to the CSEG officers.
ar: إذا لديك أسئلة أخري / مشاكل، الرجاء تحدث مع موظفي ال يس إس إي جي.
es: Si tienes más preguntas / inquietudes, por favor no temas en hablar con representantes de CSEG.

source: Wall of Shame
ar: حائط العار
es: Muro de la VergÜenza

source: These users owe Chez Betty more than $5.
ar: هاولاء الأعضاء مديونون أكثر من $5 إلا تشيز بتي
es: Estos usuarios deben más de $5 a Chez Betty.

source: Users in Debt
ar: الأعضاء في الدين
es: Usuarios en Deuda

source: uniqname
ar: يونيكنيم

source: Old Balance
ar: الرصسد القديم
es: Saldo Anterior

source: Deposit Amount
ar: الكمية الموضوعة
es: Depositar Monto

source: New Balance
ar: الرصيد الجديد
es: Nuevo Saldo

source: Transaction
ar: تعامل
es: Transacción

source: Thank you!
ar: شكراً!
de: Danke!
es: Gracias!
fr: Merci Beaucoup!

source: You successfully deposited %(amount)s into your account
ar: لقد تممت وضع كمية %(amount)s في حسابك
es: Has depositado exitosamente %(amount)s en tu cuenta

source: You successfully deposited %(amount)s in the %(pool_name)s Pool
ar: لقد تممت وضع كمية %(amount)s في مجموعة %(pool_name)s
es: Has depositado exitosamente %(amount)s en el grupo %(pool_name)s

source: Edit this Deposit
ar: غير الكمية الموضوعه
es: Editar este Depósito

source: Items
ar: الأغراض
de: Artikel
es: Productos
fr: Articles

source: Items at Chez Betty
ar: الأغراض في تشيز بتي
de: Artikel bei Chez Betty
es: Productos en Chez Betty
fr: Articles à Chez Betty

source: All that Betty has to offer.
ar: كل ما عند بتي.
de: Alles, was Betty anbietet
es: Todo lo que Betty ofrece.
fr: Tout ce que Betty a à offrir.

source: Request an Item
ar: طلب غرض
de: Einen Artikel anfragen
es: Solicita un Producto
fr: Demandez quelque article

source: Touch columns to change sort order.
ar: إلمس عاومد لكي تغير الترتيب.
es: Toca las columnas para cambiar el orden.

source: Top
ar: إلي اول الصفحة
es: Tope

source: Up
ar: إلي فوق
es: Arriba

source: Down
ar: إلي الأسفل
es: Abajo

source: Bottom
ar: إلي أخر الصفحة
es: Fondo

source: In Stock
ar: يوجد
de: Am Lager
es: Disponible
fr: En stock

source: Wholesale
ar: الجملة
de: Grosshandelnpreis
es: Al por Mayor
fr: Prix de gros

source: Price
ar: السعر
de: Preis
es: Precio
fr: Prix

source: Temporarily Out-of-Stock Items:
ar: الأغراض الغير موجودة مؤقتا:
de: Gegenwaertig nicht am Lager:
es: Productos Temporalmente Agotados:
fr: Articles temporairement pas en stock:

source: Discontinued Items:
ar: الأغراض المنوقفة:
de: Auslaufartikel:
es: Productos Descontinuados:
fr: Articles Arrêtés

source: Betty discontinues items that did not sell well or that wecannot buy any more. If you would like to request the return ofa discontinued item, please e-mail chez-betty@umich.edu.
ar: بتي يلغ الأغراض التي لا ابيع جيداً أو لا نستطيع شرائها. اذا تريد أن تطلب عودة غرض، إبعت لنا بريد إليكنروني علي chez-betty@umich.edu.
es: Betty descontinúa productos que no se vendieron bien o que ya no podemos comprar. Si quieres solicitar un producto que fue descontinuado, por favor envía un correo a chez-betty@umich.edu.

source: Purchase Complete
ar: تمم الشراء
es: Compra Completada

source: (Paid with your user account)
ar: (دفع بحسابك)
de: Bezahlt mit Ihrem Nutzer Konto
es: (Pagada con tu cuenta de usuario)
fr: Payé avec votre compte

source: (Paid with %(pool_name)s Pool)
ar: )دفع بجموعة %(pool_name)s(
de: (Bezahlt mit %(pool_name)s Pool)
es: (Pagada con el grupo %(pool_name)s)
fr: (Payé avec la compte commun %(pool_name)s)

source: If this was a mistake, touch here to undo this transaction.
ar: إذا هذه مشكلة، إلمس هنا لكي تلغي هذا التعال.
es: Si esto fue un error, toca aqui para desahacerte de esta transacción.

source: Welcome to Chez Betty!
ar: مرحباً إلي تشيز بتي!
es: Bienvenido/a a Chez Betty!

source: The 24/7 food co-op for all members of the CSE community.
ar: محل غذاء تعاوني 24/7 لكل أعضاء ال سي إس إي
de: Die Späti Genossenschaft für die ganze Mitgleider der CSE Gemeinschaft.
es: La cooperativa de alimentos para todos los miembros de la comunidad CSE.
fr: La coopérative pour l'ensemble de CSE.

source: Swipe your M-Card to login
ar: مرر كرتك ال إم كارد لكي تسجل الدخول
de: Ziehen Sie Ihre MCard durch, um anzumelden
es: Desliza tu M-Card para iniciar la sesión
fr: Glissez votre MCard pour vous identifier

source: Item List
ar: قائمة الأغراَض
de: Artikel Liste
es: Lista de Productos
fr: Liste des articles

source: About
ar: عن
de: Über
es: Acerca
fr: À propos

source: Administration
ar: الإدارة
es: Administración

source: Can you help translate Betty? E-mail chez-betty@umich.edu.
ar: هل يكمنك مساعدة ترجمة بتي؟ إبعت بريد إليكتروني إلي chez-betty@umich.edu.
es: ¿Puedes ayudar a traducir Betty? Contacta a chez-betty@umich.edu.

source: Credit Card Deposit
ar: وضع كمية كرت الكردت
de: Kreditkarteneinzahlung
es: Depósito con Tarjeta de Crédito
fr: Dépot de Carte de Crédit

source: We use stripe to process credit card transactions.
ar: نحن نستعل ستريب لكي نسير تعامل كرت الكردت.
de: Wir bentuzen stripe, um Kreditkartentransaktionen zu handeln.
es: Usamos stripe para procesar transacciones con tarjeta de crédito.
fr: Nous utilisons stripe pour traiter les transactions par carte de crédit.

source: Stripe charges 2.9% + $0.30 for each transaction.
ar: ستريب يفرض رسوم 2.9% + $0.30 لكل تعامب.
de: Stripe berechnet 2.9% + $0.30 pro jede Transaktion.
es: Stripe cobra 2.9% + $0.30 por cada transacción.
fr: Stripe perçoit une taxe de 2.9% + $0.30 pour chaque transaction.

source: We pass this charge directly onto you.
ar: نحن نفرض هذا الرسم عليك.
de: Wir geben Ihnen dieses Kost.
es: Nosotros pasamos el cobro directamente a ti.
fr: Nous donnons cette charge directement sur vous.

source: That is, if you wish to deposit $20 to your account, we will charge your card 20 + (20*0.029 + 0.30) = $20.88.
ar: مثلاً، إذا أردت أن تضع كمية $20 إلي حسابك، سوف نوجب علي كرتك 20 + (20*0.029 + 0.30) = $20.88.
es: Eso es si deseas depositar $20 a tu cuenta, vamos a cobrar a tu tarjeta 20 + (20*0.029 + 0.30) = $20.88.

source: User Account
ar: حساب العضو
de: Nutzer Konto
es: Cuenta de Usuario
fr: Compte utilisateur

source: Custom Credit Card Deposit
ar: وضع كمية كرت كردت محددة
de: Kundenspezifisch Kreditkarteneinzahlung
es: Depósito personalizado de tarjeta de crédito
fr: Dépôt personnalisée de carte de crédit

source: Add Comment
de: Kommentar hinzufügen
fr: Ajouter un Commentaire

source: Problems? Questions?
de: Problemen? Fragen?
fr: Problèmes? Questions?

source: Chez Betty is run by graduate students in CSE.
de: Chez Betty wird von CSEG geführt, die CSE graduate student group.

source: Chez Betty is Back!
de: Chez Betty ist zurück!
fr: Chez Betty est de retour!

source: You successfully deposited %(amount)s into your account.
de: Einzahlung von %(amount)s in Ihr Konto erfolgreich.

source: BTC Deposit of %(amount_in_usd)s (%(amount_in_btc)s) by %(name)s
de: BTC Einzahlung von %(amount_in_usd)s (%(amount_in_btc)s) von %(name)s

source: Enter your UMID here
fr: Entrez votre UMID ici

source: Clear
fr: Effacer
